Основы pandas HW

Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера.
Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [35]:
data = pd.read_csv('D:/PYDA/lesson_10/10._Основы_pandas/ml-latest-small/ratings.csv')
data.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [36]:
data[(data['rating'] == 5.0)]['movieId'].value_counts().head(1)

318    170
Name: movieId, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [19]:
data = pd.read_csv('D:/PYDA/lesson_10/10._Основы_pandas/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [24]:
data[ data['country'].str.contains('est|lat|lit', case = False) ]['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia', 'State of Palestine',
       'Timor-Leste'], dtype=object)

In [26]:
baltic = data[ (data['country']=='Lithuania') | (data['country']=='Latvia') | (data['country']=='Estonia') ]
baltic.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [33]:
new_baltic = baltic[(baltic['quantity'] > 0) & (baltic['category'].isin([4,12,21])) & (baltic['year'] >= 2005) & (baltic['year'] <= 2010)]
new_baltic.tail()

          country  year  quantity  category
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

In [34]:
sum(new_baltic['quantity'])

240580.0

In [ ]:
Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [43]:
auto_code = pd.read_html('http://autodr.ru/autospravka/559-avtomobilnye-kody-regionov-rossii.html')[0]
auto_code[:10]

,Список регионов,Автомобильные коды регионов России номера регионов
0,Республика Адыгея,01
1,Республика Башкортостан,"02, 102, 702"
2,Республика Бурятия,03
3,Республика Алтай,04
4,Республика Дагестан,05
5,Республика Ингушетия,06
6,Кабардино-Балкарская Республика,07
7,Республика Калмыкия,08
8,Республика Карачаево-Черкесия,09
9,Республика Карелия,10